Repository: typhoon-hil/tmxtool
Catalog: 1.0 Video Introduction-01.tmx
Source language: en
Languages: de

source: 00:00:00,499 --> 00:00:03.130 This course module addresses design and test
de: 00:00:00,499 --> 00:00:03.130 Dieses Kursmodul befasst sich mit dem Entwurf und dem Testen

source: 00:00:03,130 --> 00:00:05.680 of synchronization algorithms for three phase
de: 00:00:03,130 --> 00:00:05.680 von Synchronisationsalgorithmen für dreiphasige

source: 00:00:05,680 --> 00:00:07.600 grid-tied converters.
de: 00:00:05,680 --> 00:00:07.600 netzgebundene Umrichter.

source: 00:00:07,600 --> 00:00:10.600 The synchronization algorithm gives an estimation
de: 00:00:07,600 --> 00:00:10.600 Der Synchronisationsalgorithmus gibt eine Schätzung

source: 00:00:10,600 --> 00:00:14.380 of the grid voltage vector angular position and frequency
de: 00:00:10,600 --> 00:00:14.380 von der Winkelposition und Frequenz des Netzspannungsvektors

source: 00:00:14,380 --> 00:00:16.600 through the measured grid voltages.
de: 00:00:14,380 --> 00:00:16.600 durch die gemessenen Netzspannungen.

source: 00:00:16,600 --> 00:00:19.180 There are many synchronization algorithms,
de: 00:00:16,600 --> 00:00:19.180 Es gibt viele Synchronisationsalgorithmen,

source: 00:00:19,180 --> 00:00:22.720 such as synchronous reference frame phase locked loop,
de: 00:00:19,180 --> 00:00:22.720 wie zum Beispiel die synchrone PLL Frequenzreferenz,

source: 00:00:22,720 --> 00:00:27.730 or PLL for short, enhanced PLL, second order
de: 00:00:22,720 --> 00:00:27.730 oder kurz PLL, der erweiterte PLL,

source: 00:00:27,730 --> 00:00:30.220 generalized integrator-based phase
de: 00:00:27,730 --> 00:00:30.220 die generalisierte integratorbasierte Phase zweiter Ordnung

source: 00:00:30,220 --> 00:00:35.050 and frequency-locked loop, zero crossing detection,
de: 00:00:30,220 --> 00:00:35.050 und der Phase Locked Loop, die Nulldurchgangserkennung,

source: 00:00:35,050 --> 00:00:39.970 discrete Fourier transform, Kalman filter, among others.
de: 00:00:35,050 --> 00:00:39.970 die diskrete Fourier-Transformation, der Kalman-Filter u.a.

source: 00:00:39,970 --> 00:00:43.120 This course module will address the synchronous reference frame
de: 00:00:39,970 --> 00:00:43.120 Dieses Kursmodul befasst sich mit der synchronen

source: 00:00:43,120 --> 00:00:43.960 PLL.
de: 00:00:43,120 --> 00:00:43.960 PLL Frequenzreferenz.

source: 00:00:43,960 --> 00:00:47.150 To carry out a PLL design example,
de: 00:00:43,960 --> 00:00:47.150 Um ein PLL-Designbeispiel durchzuführen,

source: 00:00:47,150 --> 00:00:50.950 let us consider 100 kilowatt 3-phase inverter connected
de: 00:00:47,150 --> 00:00:50.950 nehmen wir an, dass ein 100 Kilowatt- dreiphasiger Wechselrichter

source: 00:00:50,950 --> 00:00:58.060 to a 380 volt 60 Hertz grid compliant with UL1741SA.
de: 00:00:50,950 --> 00:00:58.060 an ein 380-Volt-60-Hertz-Netz gemäß UL1741SA angeschlossen ist.

source: 00:00:58,060 --> 00:01:01.520 In addition, to characterize the PLL behavior,
de: 00:00:58,060 --> 00:01:01.520 Zur Charakterisierung des PLL-Verhaltens

source: 00:01:01,520 --> 00:01:05.970 let us define steady-state and transient figures of merit.
de: 00:01:01,520 --> 00:01:05.970 definieren wir zusätzlich Leistungszahlen im stationären und transienten Zustand.

source: 00:01:05,970 --> 00:01:08.270 For steady-state, frequency and angular
de: 00:01:05,970 --> 00:01:08.270 Für den stationären Zustand sind die Frequenz und der Schätzfehler

source: 00:01:08,270 --> 00:01:11.840 position estimation error, frequency ripple,
de: 00:01:08,270 --> 00:01:11.840 der Winkelposition, die Welligkeit der Frequenz

source: 00:01:11,840 --> 00:01:14.270 and THD of the sine of the estimation
de: 00:01:11,840 --> 00:01:14.270 und THD des Sinus des Schätzfehlers

source: 00:01:14,270 --> 00:01:17.330 error under normal and fault operations
de: 00:01:14,270 --> 00:01:17.330 im Normalbetrieb und bei Fehlerverhalten

source: 00:01:17,330 --> 00:01:20.600 are the considered figures of merit.
de: 00:01:17,330 --> 00:01:20.600 die berücksichtigten Leistungszahlen.

source: 00:01:20,600 --> 00:01:22.610 On the other hand, to characterize
de: 00:01:20,600 --> 00:01:22.610 Andererseits, um das Verhalten im transienten Zustand

source: 00:01:22,610 --> 00:01:26.750 the transient behavior, settling time and over and undershoot
de: 00:01:22,610 --> 00:01:26.750 zu charakterisieren, wurden die Einschwingzeit und das Über- und Unterschwingen

source: 00:01:26,750 --> 00:01:31.010 of the estimated frequency due to transit on the grid
de: 00:01:26,750 --> 00:01:31.010 der geschätzten Frequenz aufgrund der Netztransiente

source: 00:01:31,010 --> 00:01:32.090 have been considered.
de: 00:01:31,010 --> 00:01:32.090 in Betracht gezogen.

source: 00:01:32,090 --> 00:01:35.090 In order to illustrate the impact of the grid disturbance
de: 00:01:32,090 --> 00:01:35.090 Zur Veranschaulichung der Auswirkungen der Netzstörung

source: 00:01:35,090 --> 00:01:39.320 on the PLL performance, let's run a Typhoon HIL simulation.
de: 00:01:35,090 --> 00:01:39.320 auf das Verhalten des PLL, führen wir eine Typhoon HIL-Simulation durch.

source: 00:01:42,550 --> 00:01:44.920 Under balanced operating condition,
de: 00:01:42,550 --> 00:01:44.920 Unter symmetrischen Betriebsbedingungen

source: 00:01:44,920 --> 00:01:47.440 the steady-state performance is satisfactory.
de: 00:01:44,920 --> 00:01:47.440 ist das stationäre Verhalten zufriedenstellend.

source: 00:01:51,130 --> 00:01:54.650 However, under unbalanced condition simulated here
de: 00:01:51,130 --> 00:01:54.650 Allerdings wird hier unter unsymmetrischen Bedingungen simuliert,

source: 00:01:54,650 --> 00:01:58.670 by setting the voltage of phase B to 22 volts,
de: 00:01:54,650 --> 00:01:58.670 nämlich durch das Einstellen der Spannung der Phase B auf 22 Volt,

source: 00:01:58,670 --> 00:02:00.320 there are considerable distortions
de: 00:01:58,670 --> 00:02:00.320 sodass es erhebliche Verzerrungen

source: 00:02:00,320 --> 00:02:03.740 on the estimated quantities.
de: 00:02:00,320 --> 00:02:03.740 der geschätzten Größen gibt.

source: 00:02:03,740 --> 00:02:05.390 By the end of this module, you should
de: 00:02:03,740 --> 00:02:05.390 Am Ende dieses Moduls sollten Sie

source: 00:02:05,390 --> 00:02:09.740 be able to characterize the grid and this main disturbances
de: 00:02:05,390 --> 00:02:09.740 in der Lage sein, das Netz und jene Hauptstörungen zu charakterisieren,

source: 00:02:09,740 --> 00:02:15.260 that affect PLL behavior, derive a dynamic model for PLLs that
de: 00:02:09,740 --> 00:02:15.260 die sich auf das Verhalten des PLLs auswirken, ein dynamisches Modell für PLLs abzuleiten, das

source: 00:02:15,260 --> 00:02:18.290 is useful for its understanding, as well as for selecting
de: 00:02:15,260 --> 00:02:18.290 für dessen Verständnis nützlich ist, sowie für die Auswahl von

source: 00:02:18,290 --> 00:02:22.940 its parameters, design a PLL for grid-tied inverters,
de: 00:02:18,290 --> 00:02:22.940 dessen Parametern, einen PLL für netzgekoppelte Wechselrichter zu entwerfen,

source: 00:02:22,940 --> 00:02:26.960 and using a Typhoon HIL tool, employ a test-driven approach
de: 00:02:22,940 --> 00:02:26.960 und durch das Verwenden eines Typhoon HIL-Tools einen testbasierten Ansatz anzuwenden,

source: 00:02:26,960 --> 00:02:29.291 in order to benchmark PLLs.
de: 00:02:26,960 --> 00:02:29.291 um PLLs zu bewerten.
